# Typecasting

In [1]:
import pandas as pd
import numpy as np

In [13]:
import pandas as pd
import numpy as np

dict = {
    'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', np.nan, np.nan, np.nan]
}

df = pd.DataFrame(dict)

df

   first     last                    email  age
0  Corey  Schafer  CoreyMSchafer@gmail.com   33
1   Jane      Doe        JaneDoe@email.com   55
2   John      Doe        JohnDoe@email.com   63
3  Chris  Schafer                     None   36
4    NaN      NaN                      NaN  NaN
5   None      NaN      Anonymous@email.com  NaN
6     NA  Missing                       NA  NaN

- #### Typecasting age column to float

In [14]:
print('datatype of age column:', df['age'].dtype)

datatype of age column: object

In [15]:
# Since age column has NaN values, which is essentially a float datatype. We can't convert its datatype to int.
# So, we'll convert it to float
df['age'] = df['age'].astype(float)

In [16]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

- #### Typecasting whole DataFrame to String

In [21]:
df = df.astype(object)
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33.0
1   Jane      Doe        JaneDoe@email.com  55.0
2   John      Doe        JohnDoe@email.com  63.0
3  Chris  Schafer                     None  36.0
4    NaN      NaN                      NaN   NaN
5   None      NaN      Anonymous@email.com   NaN
6     NA  Missing                       NA   NaN